Zhiyi-Zhang/ndn-riot-tests/board-test/nrf52840/src/nrf_802154.h
#endif // NRF_802154_USE_RAW_API

/**
 * @brief Request transmission at specified time.
 *
 * @note This function is implemented in zero-copy fashion. It passes the given buffer pointer to
 *       the RADIO peripheral.
 *
 * This function works as delayed version of the @sref nrf_drv_radio802154_transmit_raw. It is not
 * blocking, but queues delayed transmission using Radio Scheduler module. If delayed transmission
 * cannot be performed (the @ref nrf_drv_radio802154_transmit_raw would return false) or requested
 * transmission timeslot is denied, the @ref nrf_drv_radio802154_transmit_failed with the
 * @ref NRF_802154_TX_ERROR_TIMESLOT_DENIED argument is called.
 *
 * This function is designed to transmit first symbol of SHR at given time.
 *
 * If the requested transmission time is in the past, the function returns false and does not
 * schedule transmission.
 *
 * @param[in]  p_data   Pointer to array containing data to transmit. First byte should contain frame
 *                      length (including PHR and FCS). Following bytes should contain data. CRC is
 *                      computed automatically by radio hardware. Therefore, the FCS field can
 *                      contain any bytes.
 * @param[in]  cca      If the driver should perform a CCA procedure before transmission.
 * @param[in]  t0       Base of delay time - absolute time used by the Timer Scheduler [us].
 * @param[in]  dt       Delta of delay time from @p t0 [us].
 * @param[in]  channel  Radio channel on which the frame should be transmitted.
 *
 * @retval  true   If the transmission procedure was scheduled.
 * @retval  false  If the driver could not schedule the transmission procedure.
 */
bool nrf_802154_transmit_raw_at(const uint8_t * p_data,
                                bool            cca,
                                uint32_t        t0,
                                uint32_t        dt,
                                uint8_t         channel);

/**
 * @brief Change radio state to energy detection.
 *
 * In energy detection state, the radio detects the maximum energy for a given time. The result of
 * the detection is reported to the higher layer by @ref nrf_802154_energy_detected.
 *
 * @note @ref nrf_802154_energy_detected may be called before this function returns a result.
 * @note Performing the energy detection procedure make take longer time than requested in
 *       @p time_us. The procedure is performed only during timeslots granted by a radio arbiter.
 *       It may be interrupted by other protocols using the radio hardware. If the procedure is
 *       interrupted, it is automatically continued and the sum of time periods during which the
 *       procedure is carried out is not less than the requested @p time_us.
 *
 * @param[in]  time_us   Duration of energy detection procedure. The given value is rounded up to
 *                       multiplication of 8s (128 us).
 *
 * @retval  true   If the energy detection procedure was scheduled.
 * @retval  false  If the driver could not schedule the energy detection procedure.
 */
bool nrf_802154_energy_detection(uint32_t time_us);

/**
 * @brief Change radio state to CCA.
 *
 * @note @ref nrf_802154_cca_done may be called before this function returns a result.
 *
 * In CCA state, the radio verifies if the channel is clear. The result of the verification is
 * reported to the higher layer by @ref nrf_802154_cca_done.
 *
 * @retval  true   If the CCA procedure was scheduled.
 * @retval  false  If the driver could not schedule the CCA procedure.
 */
bool nrf_802154_cca(void);

/**
 * @brief Change radio state to continuous carrier.
 *
 * @note When the radio is emitting continuous carrier signals, it blocks all transmissions on the
 *       selected channel. This function should be called only during radio tests. It should not be
 *       used during normal device operation.
 * @note This function works correctly only with a single-PHY arbiter. It should not be used with
 *       any other arbiter.
 *
 * @retval  true   If the continuous carrier procedure was scheduled.
 * @retval  false  If the driver could not schedule the continuous carrier procedure.
 */
bool nrf_802154_continuous_carrier(void);


/**
 * @}
 * @defgroup nrf_802154_calls Calls to higher layer
 * @{
 */

/**
 * @brief Notify that transmitting the ACK frame has started.
 *
 * @note This function should be very short to prevent dropping frames by the driver.
 */
extern void nrf_802154_tx_ack_started(void);

#if NRF_802154_USE_RAW_API

/**
 * @brief Notify that a frame was received.
 *
 * @note The buffer pointed to by @p p_data is not modified by the radio driver (and cannot be used
 *       to receive a frame) until @ref nrf_802154_buffer_free_raw is called.
 * @note The buffer pointed to by @p p_data may be modified by the function handler (and other
 *       modules) until @ref nrf_802154_buffer_free_raw is called.
 *
 * @verbatim
 * p_data
 * v
 * +-----+-----------------------------------------------------------+------------+
 * | PHR | MAC Header and payload                                    | FCS        |
 * +-----+-----------------------------------------------------------+------------+
 *       |                                                                        |
 *       | <---------------------------- PHR -----------------------------------> |
 * @endverbatim
 *
 * @param[in]  p_data  Pointer to the buffer containing received data (PHR + PSDU). First byte in
 *                     the buffer is length of the frame (PHR). The following bytes contain the
 *                     frame itself (PSDU). The length byte (PHR) includes FCS. FCS is already
 *                     verified by the hardware and may be modified by the hardware.
 * @param[in]  power   RSSI of received frame.
 * @param[in]  lqi     LQI of received frame.
 */
extern void nrf_802154_received_raw(uint8_t * p_data, int8_t power, uint8_t lqi);

/**
 * @brief Notify that a frame was received at a given time.
 *
 * This functions works like @ref nrf_802154_received_raw and adds a timestamp to the parameter
 * list.
 *
 * @note The received frame usually contains a timestamp. However, due to a race condition,
 *       the timestamp may be invalid. This erroneous situation is indicated by
 *       the @ref NRF_802154_NO_TIMESTAMP value of the @p time parameter.
 *
 * @param[in]  p_data  Pointer to the buffer containing received data (PHR + PSDU). First byte in
 *                     the buffer is length of the frame (PHR). The following bytes contain the
 *                     frame itself (PSDU). The length byte (PHR) includes FCS. FCS is already
 *                     verified by the hardware and may be modified by the hardware.
 * @param[in]  power   RSSI of received frame.
 * @param[in]  lqi     LQI of received frame.
 * @param[in]  time    Timestamp taken when the last symbol of the frame was received (in us)
 *                     or @ref NRF_802154_NO_TIMESTAMP if the timestamp is invalid.
 */
extern void nrf_802154_received_timestamp_raw(uint8_t * p_data,
                                              int8_t    power,
                                              uint8_t   lqi,
                                              uint32_t  time);

#else // NRF_802154_USE_RAW_API

/**
 * @brief Notify that a frame was received.
 *
 * @note The buffer pointed to by @p p_data is not modified by the radio driver (and cannot
 *       be used to receive a frame) until @ref nrf_802154_buffer_free is called.
 * @note The buffer pointed to by @p p_data may be modified by the function handler (and other
 *       modules) until @ref nrf_802154_buffer_free is called.
 *
 * @verbatim
 *       p_data
 *       v
 * +-----+-----------------------------------------------------------+------------+
 * | PHR | MAC Header and payload                                    | FCS        |
 * +-----+-----------------------------------------------------------+------------+
 *       |                                                           |
 *       | <------------------ length -----------------------------> |
 * @endverbatim
 *
 * @param[in]  p_data  Pointer to the buffer containing the payload of the received frame (PSDU
 *                     without FCS).
 * @param[in]  length  Length of received payload.
 * @param[in]  power   RSSI of received frame.
 * @param[in]  lqi     LQI of received frame.
 */
extern void nrf_802154_received(uint8_t * p_data, uint8_t length, int8_t power, uint8_t lqi);

/**
 * @brief Notify that a frame was received at a given time.
 *
 * This functions works like @ref nrf_802154_received and adds a timestamp to the parameter list.
 *
 * @note The received frame usually contains timestamp. However, due to a race condition,
 *       the timestamp may be invalid. This erroneous situation is indicated by
 *       the @ref NRF_802154_NO_TIMESTAMP value of the @p time parameter.
 *
 * @param[in]  p_data  Pointer to the buffer containing the payload of the received frame (PSDU
 *                     without FCS).
 * @param[in]  length  Length of received payload.
 * @param[in]  power   RSSI of received frame.
 * @param[in]  lqi     LQI of received frame.
 * @param[in]  time    Timestamp taken when the last symbol of the frame was received (in us)
 *                     or @ref NRF_802154_NO_TIMESTAMP if the timestamp is invalid.
 */
extern void nrf_802154_received_timestamp(uint8_t * p_data,
                                          uint8_t   length,
                                          int8_t    power,
                                          uint8_t   lqi,
                                          uint32_t  time);

